<!-- Creator     : groff version 1.21 -->
<!-- CreationDate: Wed Aug 29 09:22:54 2018 -->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta name="generator" content="groff -Thtml, see www.gnu.org">
<meta http-equiv="Content-Type" content="text/html; charset=US-ASCII">
<meta name="Content-Style" content="text/css">
<style type="text/css">
       p       { margin-top: 0; margin-bottom: 0; vertical-align: top }
       pre     { margin-top: 0; margin-bottom: 0; vertical-align: top }
       table   { margin-top: 0; margin-bottom: 0; vertical-align: top }
       h1      { text-align: center }
</style>
<title>timidity.cfg</title>

</head>
<body>

<h1 align="center">timidity.cfg</h1>

<a href="#&#21517;&#21069;">&#21517;&#21069;</a><br>
<a href="#&#35500;&#26126;">&#35500;&#26126;</a><br>
<a href="#&#22793;&#25968;">&#22793;&#25968;</a><br>
<a href="#&#25991;&#27861;">&#25991;&#27861;</a><br>
<a href="#&#12501;&#12449;&#12452;&#12523;">&#12501;&#12449;&#12452;&#12523;</a><br>
<a href="#&#38306;&#36899;&#38917;&#30446;">&#38306;&#36899;&#38917;&#30446;</a><br>
<a href="#&#33879;&#20316;&#27177;">&#33879;&#20316;&#27177;</a><br>
<a href="#&#20837;&#25163;&#20803;">&#20837;&#25163;&#20803;</a><br>

<hr>


<h2>&#21517;&#21069;
<a name="&#21517;&#21069;"></a>
</h2>


<p style="margin-left:11%; margin-top: 1em">timidity.cfg
&minus; TiMidity++
&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;</p>

<h2>&#35500;&#26126;
<a name="&#35500;&#26126;"></a>
</h2>



<p style="margin-left:11%; margin-top: 1em"><b>timidity.cfg</b>
&#12399;&#65292;timidity(1)
&#12398;&#23455;&#34892;&#26178;&#12398;&#27096;&#12293;&#12394;&#35373;&#23450;&#12434;&#34892;&#12358;&#12383;&#12417;&#12398;&#35373;&#23450;
&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#38899;&#33394;&#12487;&#12540;&#12479;&#12398;&#32622;&#12365;&#22580;&#25152;&#65292;&#38899;&#33394;&#33258;&#20307;&#12398;&#35373;&#23450;&#65292;&#12381;&#12398;&#20182;&#35576;&#12293;&#12434;&#35373;&#23450;&#12377;
&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
<b><br>
TiMidity++</b>
&#12399;&#65292;&#36215;&#21205;&#26178;&#12395;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35211;&#12427;&#21069;&#12395;&#65292;
<b>timidity.cfg</b>
&#12434;&#25506;&#32034;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#65292;&#12414;
&#12383;&#12521;&#12452;&#12502;&#12521;&#12522;&#12497;&#12473;&#12364;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12391;
<b>&minus;L</b>
&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#22793;&#26356;&#12373;&#12428;
&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#65292;&#12377;&#12409;&#12390;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35211;&#12383;&#24460;&#12395;&#65292;&#26032;&#12375;&#12356;&#12521;&#12452;&#12502;&#12521;&#12522;&#12497;&#12473;&#12395;&#24467;&#12387;
&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12501;&#12449;&#12452;&#12523;&#12434;(<b>&minus;c</b>
&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#21029;&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12364;&#25351;&#23450;&#12373;&#12428;
&#12390;&#12356;&#12394;&#12356;&#12394;&#12425;&#12400;)&#20877;&#25506;&#32034;&#12375;&#12414;&#12377;&#12290;
<br>

&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12399;&#65292;MIDI
&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;
&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;&#65292;&#35079;&#25968;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12399;&#65292;&#24460;&#12395;&#35501;&#12415;&#36796;&#12414;&#12428;
&#12383;&#35373;&#23450;&#12395;&#12424;&#12387;&#12390;&#21069;&#12398;&#35373;&#23450;&#12364;&#19978;&#26360;&#12365;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<h2>&#22793;&#25968;
<a name="&#22793;&#25968;"></a>
</h2>



<p style="margin-left:11%; margin-top: 1em">&#12489;&#12523;&#35352;&#21495;
&lsquo; $&rsquo;
&#12395;&#32154;&#12369;&#12390;&#33521;&#25968;&#23383;&#12420;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;
&lsquo; _&rsquo;
&#12364;&#32154;&#12356;&#12390;&#12356;&#12427;&#22580;&#21512;&#65292;&#12381;&#12398;
&#25991;&#23383;&#21015;&#12399;&#22793;&#25968;&#12392;&#35211;&#12394;&#12373;&#12428;&#65292;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12434;&#20966;&#29702;&#12377;&#12427;&#38555;&#12395;&#21029;&#12398;&#25991;&#23383;&#21015;&#12395;&#32622;&#12365;&#25563;&#12360;
&#12425;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22793;&#25968;&#21517;&#12399;&#65292;&#24460;&#32154;&#12398;&#25991;&#23383;&#12392;&#21306;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#65292;&#20013;&#25324;&#24359;&#20184;&#12365;&#12391;&#34920;&#35352;&#12377;
&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%; margin-top: 1em">&#20363;: <br>
$variable <br>
${variable} # $variable &#12392;&#21516;&#32681;</p>


<p style="margin-left:11%; margin-top: 1em">&#22793;&#25968;&#12434;&#26032;&#12383;&#12395;&#23450;&#32681;&#12377;&#12427;&#21629;&#20196;&#12399;&#65292;&#20170;&#12398;&#12392;&#12371;&#12429;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#26410;&#23450;&#32681;&#12398;&#22793;&#25968;
&#12399;&#65292;&#31354;&#25991;&#23383;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
<br>

&#35215;&#23450;&#12398;&#22793;&#25968;&#12392;&#12375;&#12390;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#22793;&#25968;&#12399;&#65292;&#27425;&#12398;
1 &#12388;&#12384;&#12369;&#12391;&#12377;&#12290; <b><br>
$basedir</b></p>


<p style="margin-left:22%;">&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;&#20027;&#12395;&#12497;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#21629;&#20196;&#12391;&#65292;
&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12398;&#30456;&#23550;&#12497;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#30446;&#30340;&#12391;&#20351;&#12356;&#12414;&#12377;&#12290;
<br>
$basedir
&#12395;&#31354;&#30333;&#12364;&#21547;&#12414;&#12428;&#12427;&#12363;&#12418;&#30693;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#65292;&quot;&quot;
&#12391;&#25324;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%; margin-top: 1em">&#20363;: <br>
/usr/local/share/timidity/timidity.cfg &#20869;&#12391; <br>
dir $basedir/inst # source /usr/local/share/timidity/inst
&#12392;&#35299;&#37320;&#12373;&#12428;&#12427;</p>

<h2>&#25991;&#27861;
<a name="&#25991;&#27861;"></a>
</h2>



<p style="margin-left:11%; margin-top: 1em">&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#20013;&#12395;&#12399;&#20197;&#19979;&#12398;&#26360;&#24335;&#12364;&#25351;&#23450;&#21487;&#33021;&#12391;&#12377;&#12290;
<b><br>
dir</b> <i>directory [...]</i></p>

<p style="margin-left:22%;"><i>directory</i>
&#12434;&#25506;&#32034;&#12497;&#12473;&#12395;&#21152;&#12360;&#12414;&#12377;&#12290;&#21152;&#12360;&#26041;&#12399;
<b>&minus;L</b>
&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#21516;
&#27096;&#12391;&#12377;&#12290; <b><br>
TiMidity++</b>
&#12391;&#12399;&#65292;&#12450;&#12540;&#12459;&#12452;&#12502;&#12501;&#12449;&#12452;&#12523;&#12434;&#12497;&#12483;&#12481;&#12475;&#12483;&#12488;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;
&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%; margin-top: 1em">&#20363;: <br>
dir /usr/local/share/timidity/inst/foo.zip# <br>
bank 0 <br>
0 bar.pat <br>
1 baz.pat <br>
2 zoo.pat</p>


<p style="margin-left:22%; margin-top: 1em">&#12414;&#12378;&#65292;<b>dir</b>
&#12391;&#36890;&#24120;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12424;&#12358;&#12395;&#12450;&#12540;&#12459;&#12452;&#12502;&#12501;&#12449;&#12452;&#12523;(&#19978;&#12398;&#20363;&#12391;
&#12399;/usr/local/share/timidity/inst/foo.zip)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12392;&#12365;&#65292;&#12450;&#12540;&#12459;
&#12452;&#12502;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#26368;&#24460;&#12395;
&lsquo; #&rsquo;
&#12434;&#20184;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;
&lsquo; #&rsquo;
&#12364;&#12354;&#12427;&#12371;&#12392;&#12391;&#65292;&#12450;
&#12540;&#12459;&#12452;&#12502;&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;
<b>TiMidity++</b>
&#12399;&#35469;&#35672;&#12375;&#12414;&#12377;&#12290;&#12371;&#12358;&#12375;&#12390;&#12362;
&#12367;&#12392;&#65292;<b>dir</b>
&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12540;&#12459;&#12452;&#12502;&#12501;&#12449;&#12452;&#12523;&#12398;&#20013;&#12398;&#12497;&#12483;&#12481;&#12501;&#12449;&#12452;&#12523;&#12418;&#35501;
&#12415;&#36796;&#12415;&#23550;&#35937;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#19978;&#12398;&#20363;&#12391;&#12399;&#65292;foo.zip
&#12398;&#20013;&#12395;&#12354;&#12427;
bar.pat&#65292;baz.pat&#65292; zoo.pat
&#12364;&#35501;&#12415;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>source</b> <i>file
[...]</i></p>


<p style="margin-left:22%;">&#20182;&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12434;&#12381;&#12398;&#22580;&#25152;&#12395;&#25407;&#20837;&#12375;&#65292;&#32154;&#34892;&#12375;&#12414;&#12377;&#12290;<b>source</b>
&#12398;&#12493;&#12473;&#12488;&#12399; 50
&#27573;&#12414;&#12391;&#21487;&#33021;&#12391;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>progbase</b>
<i>number</i></p>


<p style="margin-left:22%;">&#12371;&#12428;&#20197;&#38477;&#65292;&#12503;&#12525;&#12464;&#12521;&#12512;&#30058;&#21495;&#12434;
<i>number</i> &#12363;&#12425; <i>number</i>+128
&#12391;&#35373;&#23450;&#12539;
&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#65292;<b>progbase
1</b>
&#12392;&#12375;&#12383;&#22580;&#21512;&#12399;&#65292;&#12381;&#12428;&#20197;&#38477;&#12503;&#12525;&#12464;&#12521;&#12512;&#30058;
&#21495;&#12399; <b>1</b> &#12363;&#12425; <b>128</b>
&#12391;&#35373;&#23450;&#12539;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>bank</b> <i>[MapID1]
number</i></p>


<p style="margin-left:22%;">&#12371;&#12428;&#20197;&#38477;&#22793;&#26356;&#12377;&#12427;&#12488;&#12540;&#12531;&#12496;&#12531;&#12463;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#25991;&#20197;&#24460;&#12398;
patch &#12398;&#23550;&#24540;&#20184;&#12369;
&#12399;&#65292;&#25351;&#23450;&#12373;&#12428;&#12383;&#12488;&#12540;&#12531;&#12496;&#12531;&#12463;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;<i>MapID1</i>
&#12395;
<b>gm2</b>&#65292;<b>sc55</b>&#65292;<b>sc88</b>&#65292;<b>sc88pro</b>&#65292;<b>sc8850</b>&#65292;
<b>xg</b>&#65292;<b>xgsfx64</b>
&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292;&#29305;&#23450;&#12398;&#12510;&#12483;&#12503;&#12434;&#23550;&#35937;
&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>drumset</b> <i>[MapID2]
number</i></p>


<p style="margin-left:22%;">&#22793;&#26356;&#12377;&#12427;&#12489;&#12521;&#12512;&#12475;&#12483;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#25991;&#20197;&#24460;&#12398;
patch
&#12398;&#23550;&#24540;&#20184;&#12369;&#12399;&#65292;&#25351;&#23450;
&#12373;&#12428;&#12383;&#12489;&#12521;&#12512;&#12475;&#12483;&#12488;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;<i>MapID2</i>
&#12395; <b>gm2drum</b>&#65292;
<b>sc55drum</b>&#65292;<b>sc88drum</b>&#65292;<b>sc88prodrum</b>&#65292;<b>sc8850drum</b>&#65292;
<b>xgdrum</b>&#65292;<b>xgsfx126</b>
&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292;&#29305;&#23450;&#12398;&#12510;&#12483;&#12503;&#12434;
&#23550;&#35937;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>number</b> <i>file
[options]</i> <b><br>
number %font</b> <i>file bank prog [key] [options]</i>
<b><br>
number %sample</b> <i>file [options]</i></p>


<p style="margin-left:22%;">&#29694;&#22312;&#12398;&#12488;&#12540;&#12531;&#12496;&#12531;&#12463;&#12420;&#12489;&#12521;&#12512;&#12475;&#12483;&#12488;&#12391;&#65292;MIDI
&#12503;&#12525;&#12464;&#12521;&#12512;&#12490;&#12531;&#12496;&#12540;
<b>number</b> &#12391;&#20351;&#29992;&#12377;&#12427; patch
&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<i>file</i>
&#12364; SoundFont
&#12398;&#22580;&#21512;&#12399;&#65292;<b>number %font</b>
&#12398;&#26360;&#24335;&#12391;&#29305;&#23450;&#12398;
<i>bank</i>&#65292; <i>prog</i>&#65292;<i>key</i>
&#12398;&#38899;&#33394;&#12487;&#12540;&#12479;&#12434;&#21462;&#12426;&#20986;&#12375;&#12414;&#12377;&#12290;<i>file</i>
&#12364;&#28961;&#22311;&#32302;&#12398; WAV
&#24418;&#24335;&#12414;&#12383;&#12399; AIFF
&#24418;&#24335;&#12398;&#12469;&#12531;&#12503;&#12523;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#21512;&#12399;&#65292;<b>number
%sample</b>
&#12398;&#26360;&#24335;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<i>options</i>
&#12399;&#65292;&#27425;&#12398;&#12418;&#12398;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;
<b><br>
amp=</b><i>amplification</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;&#12508;&#12522;&#12517;&#12540;&#12512;&#12434;
<i>amplification</i>%
&#12395;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;&#20516;&#12364;
&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#65292;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12364;&#35501;&#12415;&#36796;&#12414;&#12428;&#12427;&#26178;&#12395;&#33258;&#21205;&#30340;&#12395;&#35373;&#23450;&#12373;
&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>note=</b><i>note</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12434;&#28436;&#22863;&#12377;&#12427;&#26178;&#12395;&#27770;&#12414;&#12387;&#12383;
MIDI
&#12494;&#12540;&#12488;(&#38899;&#38542;)&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
<i>note</i> &#12434; <b>0</b>
&#12395;&#12377;&#12427;&#12392;&#65292;&#26368;&#21021;&#12395;
Note On
&#12452;&#12505;&#12531;&#12488;&#12364;&#30330;&#29983;&#12375;&#12383;&#26178;&#28857;&#12391;
&#12398;&#12494;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12497;&#12540;&#12459;&#12483;&#12471;&#12519;&#12531;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390;&#12399;&#65292;&#12418;&#12375;&#35373;
&#23450;&#12501;&#12449;&#12452;&#12523;&#12391;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#65292;patch
&#12501;&#12449;&#12452;&#12523;&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#20516;&#12434;&#20351;
&#29992;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>pan=</b><i>panning</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12497;&#12531;&#12491;&#12531;&#12464;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<i>panning</i>
&#12399;
<b>left</b>&#65292;<b>right</b>&#65292;<b>center</b>&#65292;&#12354;&#12427;&#12356;&#12399;
<b>&minus;100</b> &#12363;&#12425; <b>100</b>
&#12414;&#12391;&#12398;&#25972;&#25968;&#20516;&#12434;&#21462;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;<b>&minus;100</b>
&#12364;&#26368;&#12418;&#24038;&#65292; <b>100</b>
&#12364;&#26368;&#12418;&#21491;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20516;&#12364;&#19982;&#12360;&#12425;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#65292;patch
&#12501;&#12449;
&#12452;&#12523;&#12395;&#20837;&#12387;&#12390;&#12356;&#12427;&#20516;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#65292;MIDI
&#12501;&#12449;&#12452;&#12523;&#20013;&#12398;&#12497;&#12531;&#12491;&#12531;&#12464;&#12467;
&#12531;&#12488;&#12525;&#12540;&#12523;&#12398;&#26041;&#12364;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>tune=</b><i>tuning[,...]</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;&#12523;&#12540;&#12488;&#21608;&#27874;&#25968;&#12434;&#35519;&#25972;&#12375;&#12414;&#12377;&#12290;<b>tune=1</b>
&#12392;&#12377;&#12428;&#12400; <b>1</b>
&#21322;&#38899;&#19978;&#12364;&#12426;&#12414;&#12377;&#12290;<i>tuning</i>
&#12395;&#12399;&#23567;&#25968;&#12364;&#21033;&#29992;&#21487;&#33021;&#12394;&#12398;&#12391;&#65292;
<b>tune=&minus;0.2</b>
&#12394;&#12393;&#12398;&#24494;&#35519;&#25972;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#20108;&#12388;&#30446;&#20197;&#38477;&#12398;&#24341;&#25968;&#12399;&#65292;&#38899;&#22495;&#21029;&#12395;&#35079;
&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12487;&#12540;&#12479;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#65292;&#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#20516;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>rate=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;
ADSR
&#12524;&#12540;&#12488;&#12434;&#35373;&#23450;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;<b>0</b>
&#12363;&#12425; <b>255</b>
&#12414;&#12391;&#12398;&#20516;&#12364;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12469;&#12473;&#12486;&#12452;&#12531;&#12524;&#12540;&#12488;&#12384;&#12369;&#12434;&#35036;&#27491;&#12375;&#12383;&#12356;&#22580;&#21512;
&#12394;&#12393;&#65292;</p>

<p style="margin-left:32%; margin-top: 1em">6
GUS/hrpschrd.pat rate=::60</p>


<p style="margin-left:32%; margin-top: 1em">&#12398;&#12424;&#12358;&#12394;&#29401;&#12356;&#25731;&#12385;&#35373;&#23450;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#12414;&#12383;&#65292;&#12450;&#12479;&#12483;&#12463;&#12479;&#12452;&#12512;&#12434;&#36895;&#12367;&#12375;&#12383;&#12356;&#12384;&#12369;&#12391;
&#12354;&#12428;&#12400;&#65292;</p>

<p style="margin-left:32%; margin-top: 1em">6
GUS/hrpschrd.pat rate=255</p>


<p style="margin-left:32%; margin-top: 1em">&#12392;&#12356;&#12358;&#26360;&#12365;&#26041;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20108;&#12388;&#30446;&#20197;&#38477;&#12398;&#24341;&#25968;&#12399;&#65292;&#38899;&#22495;&#21029;&#12395;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12487;&#12540;
&#12479;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#65292;&#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#20516;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>offset=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;
ADSR
&#12458;&#12501;&#12475;&#12483;&#12488;&#12434;&#35373;&#23450;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;<b>0</b>
&#12363; &#12425; <b>255</b>
&#12414;&#12391;&#12398;&#20516;&#12364;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
&#26360;&#24335;&#12395;&#12388;&#12356;&#12390;&#12399;&#65292;&#12411;&#12412;
<b>rate=</b>
&#12392;&#21516;&#27096;&#12391;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>keep={loop|env}</b></p>


<p style="margin-left:32%;">&#12497;&#12540;&#12459;&#12483;&#12471;&#12519;&#12531;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12391;&#12399;&#65292;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12523;&#12540;&#12503;&#24773;&#22577;&#12392;&#12456;&#12531;&#12505;&#12525;&#12540;
&#12503;&#24773;&#22577;&#12364;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#65292;&#12513;&#12525;&#12487;&#12451;&#12540;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12395;&#30064;&#24120;&#12394;&#12456;&#12531;&#12505;&#12525;
&#12540;&#12503;&#12364;&#23384;&#22312;&#12375;&#12383;&#22580;&#21512;&#12395;&#12418;&#65292;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#24773;&#22577;&#12399;&#33258;&#21205;&#30340;&#12395;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;
<b>keep=</b>
&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#65292;&#12523;&#12540;&#12503;&#24773;&#22577;&#12420;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#24773;&#22577;&#12364;&#30772;&#26820;&#12373;&#12428;&#12427;
&#12398;&#12434;&#38450;&#12366;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#65292;Short&#65292;Long
Whistle
&#12497;&#12540;&#12459;&#12483;&#12471;&#12519;&#12531;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;
&#12488;(General MIDI &#12398; 71&#65292;72
&#30058;)&#12395;&#23550;&#12375;&#12390;&#12399;&#65292;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12391;
<b>keep=loop keep=env</b>
&#12392;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>strip={loop|env|tail}</b></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;
patch
&#12398;&#12523;&#12540;&#12503;&#24773;&#22577;&#12420;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#24773;&#22577;&#12420;&#12486;
&#12540;&#12523;(&#12523;&#12540;&#12503;&#12398;&#24460;&#12395;&#12354;&#12427;&#12487;&#12540;&#12479;)&#12434;&#12377;&#12409;&#12390;&#24375;&#21046;&#30340;&#12395;&#30772;&#26820;&#12375;&#12414;&#12377;&#12290;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;
&#12540;&#12398;&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12395;&#12399;&#65292;&#12523;&#12540;&#12503;&#12398;&#24460;&#12395;&#12468;&#12511;&#12364;&#20184;&#12356;&#12390;&#12356;&#12427;&#12418;&#12398;&#12364;&#12354;&#12426;&#65292;&#12452;&#12531;
&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12434;&#28436;&#22863;&#12377;&#12427;&#24230;&#12395;&#12463;&#12522;&#12483;&#12461;&#12531;&#12464;&#12494;&#12452;&#12474;&#12364;&#20837;&#12387;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;
&#12377;&#12290;&#12381;&#12398;&#22580;&#21512;&#65292;<b>strip=tail</b>
&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12377;&#12428;&#12400;&#38899;&#36074;&#12364;&#25913;&#21892;&#12373;&#12428;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>tremolo=</b><i>sweep_increment:control_ratio:depth[,...]</i></p>


<p style="margin-left:32%;">&#12488;&#12524;&#12514;&#12525;&#12434;&#35373;&#23450;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;<b>0</b>
&#12363;&#12425; <b>255</b>
&#12414;&#12391;&#12398;&#20516;&#12364;&#25351;&#23450;
&#12391;&#12365;&#12414;&#12377;&#12290;<b>rate=</b>
&#21516;&#27096;&#65292;&#29401;&#12356;&#25731;&#12385;&#35373;&#23450;&#12420;&#19981;&#35201;&#37096;&#20998;&#12398;&#30465;&#30053;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;
<i>sweep_increment</i>
&#12399;&#30330;&#38899;&#12375;&#12390;&#12363;&#12425;&#12488;&#12524;&#12514;&#12525;&#12364;&#25499;&#12363;&#12426;&#22987;&#12417;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#65292;
<i>control_ratio</i>
&#12399;&#25391;&#24133;&#12364;&#22793;&#21270;&#12377;&#12427;&#36895;&#12373;&#65292;<i>depth</i>
&#12399;&#25391;&#24133;&#12364;&#22793;&#21270;&#12377;&#12427;
&#28145;&#12373;&#12391;&#12377;&#12290;<b>rate=</b>
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>vibrato=</b><i>sweep_increment:phase_increment:depth[,...]</i></p>


<p style="margin-left:32%;">&#12499;&#12502;&#12521;&#12540;&#12488;&#12434;&#35373;&#23450;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;<b>0</b>
&#12363;&#12425; <b>255</b>
&#12414;&#12391;&#12398;&#20516;&#12364;&#25351;
&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;<b>rate=</b>
&#21516;&#27096;&#65292;&#29401;&#12356;&#25731;&#12385;&#35373;&#23450;&#12420;&#19981;&#35201;&#37096;&#20998;&#12398;&#30465;&#30053;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;
<i>sweep_increment</i>
&#12399;&#30330;&#38899;&#12375;&#12390;&#12363;&#12425;&#12499;&#12502;&#12521;&#12540;&#12488;&#12364;&#25499;&#12363;&#12426;&#22987;&#12417;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#65292;
<i>phase_increment</i>
&#12399;&#21608;&#27874;&#25968;&#12364;&#22793;&#21270;&#12377;&#12427;&#36895;&#12373;&#65292;<i>depth</i>
&#12399;&#21608;&#27874;&#25968;&#12364;&#22793;
&#21270;&#12377;&#12427;&#28145;&#12373;&#12391;&#12377;&#12290;<b>rate=</b>
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>sclnote=</b><i>note[,...]</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;&#12473;&#12465;&#12540;&#12523;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12398;&#22522;&#28310;&#12392;&#12377;&#12427;&#12494;&#12540;&#12488;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#65292;<b>sclnote=60</b>
&#12392;&#12377;&#12428;&#12400;&#65292;&#30495;&#12435;&#20013;&#12398;&#12489;&#12434;&#20013;&#24515;&#12395;&#12473;&#12465;&#12540;&#12523;&#12481;&#12517;&#12540;&#12491;&#12531;
&#12464;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#20108;&#12388;&#30446;&#20197;&#38477;&#12398;&#24341;&#25968;&#12399;&#65292;&#38899;&#22495;&#21029;&#12395;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12487;&#12540;&#12479;&#12364;&#21547;&#12414;
&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#65292;&#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#20516;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>scltune=</b><i>tune[,...]</i></p>


<p style="margin-left:32%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#12398;&#12473;&#12465;&#12540;&#12523;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12398;&#24230;&#21512;&#12356;&#12434;
cent
&#21336;&#20301;&#12391;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#65292;<b>scltune=50</b>
&#12392;&#12377;&#12428;&#12400;&#65292;&#12494;&#12540;&#12488;&#38291;&#38548;&#12364;
<b>50</b> cent &#12395;&#12394;&#12426;&#12414;
&#12377;&#12290;&#20108;&#12388;&#30446;&#20197;&#38477;&#12398;&#24341;&#25968;&#12399;&#65292;&#38899;&#22495;&#21029;&#12395;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12487;&#12540;&#12479;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;
&#12395;&#65292;&#12381;&#12428;&#12382;&#12428;&#21029;&#12398;&#20516;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>comm=</b><i>comment</i></p>

<p style="margin-left:32%;"><i>comment</i>
&#12364;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;<b>#extension
comm</b>
&#12392;&#21516;&#12376;&#21177;&#26524;&#12391;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>modrate=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i>
<b><br>

modoffset=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12514;&#12472;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12398;&#22793;&#21270;&#12398;&#20181;&#26041;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#35373;&#23450;&#26041;&#27861;&#12420;&#20516;&#12399;&#65292;
&#22522;&#26412;&#30340;&#12395;&#12508;&#12522;&#12517;&#12540;&#12512;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#19968;&#37096;&#12398;
SoundFont &#12434;&#38500;&#12369;&#12400;&#65292;
&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12384;&#12369;&#12434;&#25351;&#23450;&#12375;&#12390;&#12418;&#20309;&#12418;&#36215;&#12371;&#12426;&#12414;&#12379;&#12435;&#12290;</p>


<p style="margin-left:22%;"><b>envkeyf=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12508;&#12522;&#12517;&#12540;&#12512;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12461;&#12540;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<b>note=60</b>
&#12434;&#22522;
&#28310;&#12392;&#12375;&#12390;&#65292;&#12494;&#12540;&#12488;&#12395;&#24467;&#12356;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12479;&#12452;&#12512;&#12434;&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent/key
&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;
<b>envkeyf=100</b>
&#12392;&#25351;&#23450;&#12377;&#12427;&#12392;&#65292;1
&#12458;&#12463;&#12479;&#12540;&#12502;&#19978;
&#12364;&#12427;&#12383;&#12403;&#12395;&#12450;&#12479;&#12483;&#12463;&#12539;&#12479;&#12452;&#12512;&#12364;
2
&#20493;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<b>rate=</b>
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;
&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#19968;&#37096;&#12398;
SoundFont &#12391;&#12399;&#65292;<i>decay</i>&#12392;
<i>sustain</i>
&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12364;&#20104;&#12417;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>envvelf=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12508;&#12522;&#12517;&#12540;&#12512;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12505;&#12525;&#12471;&#12486;&#12451;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
<b>velocity=64</b>
&#12434;&#22522;&#28310;&#12392;&#12375;&#12390;&#65292;&#12505;&#12525;&#12471;&#12486;&#12451;&#12395;&#24467;&#12356;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12479;&#12452;&#12512;&#12434;
&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent/velocity
&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;
<b>envvelf=100</b> &#12392;
&#25351;&#23450;&#12377;&#12427;&#12392;&#65292;<b>velocity=127</b>
&#12391;&#12450;&#12479;&#12483;&#12463;&#12539;&#12479;&#12452;&#12512;&#12364;&#32004;
38 &#20493;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
<b>rate=</b>
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;
&#12399;&#65292;&#36817;&#12356;&#23558;&#26469;&#20181;&#27096;&#22793;&#26356;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>modkeyf=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12514;&#12472;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12461;&#12540;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<b>note=60</b>
&#12434;&#22522;&#28310;&#12392;&#12375;&#12390;&#65292;&#12494;&#12540;&#12488;&#12395;&#24467;&#12356;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12479;&#12452;&#12512;&#12434;&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent/key
&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;
<b>modkeyf=100</b>
&#12392;&#25351;&#23450;&#12377;&#12427;&#12392;&#65292;1
&#12458;&#12463;&#12479;&#12540;&#12502;&#19978;
&#12364;&#12427;&#12383;&#12403;&#12395;&#12450;&#12479;&#12483;&#12463;&#12539;&#12479;&#12452;&#12512;&#12364;
2
&#20493;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;<b>rate=</b>
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;
&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#19968;&#37096;&#12398;
SoundFont &#12391;&#12399;&#65292;<i>decay</i>&#12392;
<i>sustain</i>
&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12364;&#20104;&#12417;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>modvelf=</b><i>attack:decay:sustain:release1:release2:release3[,...]</i></p>


<p style="margin-left:32%;">&#12514;&#12472;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12505;&#12525;&#12471;&#12486;&#12451;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
<b>velocity=64</b>
&#12434;&#22522;&#28310;&#12392;&#12375;&#12390;&#65292;&#12505;&#12525;&#12471;&#12486;&#12451;&#12395;&#24467;&#12356;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12539;&#12479;&#12452;&#12512;&#12434;
&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent/velocity
&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;
<b>modvelf=100</b> &#12392;
&#25351;&#23450;&#12377;&#12427;&#12392;&#65292;<b>velocity=127</b>
&#12391;&#12450;&#12479;&#12483;&#12463;&#12539;&#12479;&#12452;&#12512;&#12364;&#32004;
38 &#20493;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
<b>rate=</b>
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;
&#12399;&#65292;&#36817;&#12356;&#23558;&#26469;&#20181;&#27096;&#22793;&#26356;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>trempitch=</b><i>num[,...]</i></p>


<p style="margin-left:32%;">&#12488;&#12524;&#12514;&#12525;&#12395;&#24467;&#12387;&#12390;&#65292;&#12500;&#12483;&#12481;&#12434;&#22793;&#21270;&#12373;&#12379;&#12427;&#28145;&#24230;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#21177;&#26524;&#12381;&#12398;&#12418;&#12398;&#12399;&#12499;
&#12502;&#12521;&#12540;&#12488;&#12392;&#19968;&#32210;&#12391;&#12377;&#12364;&#65292;&#21029;&#31995;&#32113;&#12391;&#21205;&#20316;&#12373;&#12379;&#12383;&#12356;&#12392;&#12365;&#12395;&#21033;&#29992;&#12375;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent &#12391;&#12377;&#12290;<b>rate=</b>
&#12392;&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>tremfc=</b><i>num[,...]</i></p>


<p style="margin-left:32%;">&#12488;&#12524;&#12514;&#12525;&#12395;&#24467;&#12387;&#12390;&#65292;&#12501;&#12451;&#12523;&#12479;&#12539;&#12459;&#12483;&#12488;&#12458;&#12501;&#21608;&#27874;&#25968;&#12434;&#22793;&#21270;&#12373;&#12379;&#12427;&#28145;&#24230;&#12434;&#35373;&#23450;&#12375;&#12414;
&#12377;&#12290;&#12356;&#12431;&#12422;&#12427;&#12300;&#12464;&#12525;&#12454;&#12523;&#21177;&#26524;&#12301;&#12434;&#34920;&#29694;&#12391;&#12365;&#12414;&#12377;&#12290;&#21336;&#20301;&#12381;&#12398;&#20182;&#12399;
<b>trempitch=</b>
&#12392;&#21516;&#19968;&#12391;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>modpitch=</b><i>num[,...]</i></p>


<p style="margin-left:32%;">&#12514;&#12472;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12395;&#24467;&#12387;&#12390;&#65292;&#12500;&#12483;&#12481;&#12434;&#22793;&#21270;&#12373;&#12379;&#12427;&#28145;&#24230;&#12434;&#35373;&#23450;&#12375;
&#12414;&#12377;&#12290;&#12450;&#12479;&#12483;&#12463;&#26178;&#12384;&#12369;&#19968;&#26178;&#30340;&#12395;&#38899;&#31243;&#12364;&#19978;&#12364;&#12427;&#12394;&#12393;&#12398;&#34920;&#29694;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#21336;&#20301;&#12381;&#12398;
&#20182;&#12399; <b>trempitch=</b>
&#12392;&#21516;&#19968;&#12391;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>modfc=</b><i>num[,...]</i></p>


<p style="margin-left:32%;">&#12514;&#12472;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;&#12539;&#12456;&#12531;&#12505;&#12525;&#12540;&#12503;&#12395;&#24467;&#12387;&#12390;&#65292;&#12501;&#12451;&#12523;&#12479;&#12539;&#12459;&#12483;&#12488;&#12458;&#12501;&#21608;&#27874;&#25968;&#12434;&#22793;
&#21270;&#12373;&#12379;&#12427;&#28145;&#24230;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#21336;&#20301;&#12381;&#12398;&#20182;&#12399;
<b>trempitch=</b>
&#12392;&#21516;&#19968;&#12391;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>fc=</b><i>num[,...]</i></p>


<p style="margin-left:32%;">&#12501;&#12451;&#12523;&#12479;&#12539;&#12459;&#12483;&#12488;&#12458;&#12501;&#21608;&#27874;&#25968;&#12398;&#22522;&#28310;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
Hz &#12391;&#12377;&#12290; <b>rate=</b>
&#12392;&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>q=</b><i>num[,...]</i></p>


<p style="margin-left:32%;">&#12501;&#12451;&#12523;&#12479;&#12540;&#12398;
Q(&#12524;&#12478;&#12490;&#12531;&#12473;)&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
cB &#12391;&#12377;&#12290;<b>rate=</b> &#12392;
&#21516;&#27096;&#65292;&#35079;&#25968;&#12398;&#12469;&#12531;&#12503;&#12523;&#12395;&#23550;&#12377;&#12427;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>fckeyf=</b><i>num</i></p>


<p style="margin-left:32%;">&#12501;&#12451;&#12523;&#12479;&#12539;&#12461;&#12540;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<b>note=60</b>
&#12434;&#22522;&#28310;&#12392;&#12375;&#12390;&#65292;&#12494;&#12540;&#12488;
&#12395;&#24467;&#12356;&#12459;&#12483;&#12488;&#12458;&#12501;&#21608;&#27874;&#25968;&#12434;&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent/key &#12391;&#65292;&#20363;&#12360;&#12400;
<b>100</b>
&#12434;&#25351;&#23450;&#12377;&#12428;&#12400;&#65292;&#38899;&#31243;&#12392;&#21516;&#12376;&#12384;&#12369;&#22793;&#21270;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>fcvelf=</b><i>num</i></p>


<p style="margin-left:32%;">&#12501;&#12451;&#12523;&#12479;&#12539;&#12505;&#12525;&#12471;&#12486;&#12451;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<b>velocity=127</b>
&#12434;&#22522;&#28310;&#12392;&#12375;
&#12390;&#65292;&#12505;&#12525;&#12471;&#12486;&#12451;&#12395;&#24467;&#12356;&#12459;&#12483;&#12488;&#12458;&#12501;&#21608;&#27874;&#25968;&#12434;&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cent &#12391;&#65292; SoundFont &#12391;&#12399;
<b>&minus;2400</b>
&#12364;&#22266;&#26377;&#20516;&#12392;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>qvelf=</b><i>num</i></p>


<p style="margin-left:32%;">&#12524;&#12478;&#12490;&#12531;&#12473;&#12539;&#12505;&#12525;&#12471;&#12486;&#12451;&#12501;&#12457;&#12525;&#12540;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<b>velocity=0</b>
&#12434;&#22522;&#28310;&#12392;&#12375;
&#12390;&#65292;&#12505;&#12525;&#12471;&#12486;&#12451;&#12395;&#24467;&#12356;&#12524;&#12478;&#12490;&#12531;&#12473;&#12434;&#22793;&#21270;&#12373;&#12379;&#12414;&#12377;&#12290;&#21336;&#20301;&#12399;
+&minus;cB &#12391;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>default</b> <i>file</i></p>


<p style="margin-left:22%;">&#20182;&#12398;&#12393;&#12371;&#12395;&#12418;&#35373;&#23450;&#12364;&#12394;&#12356;&#12424;&#12358;&#12394;&#38899;&#12395;&#20986;&#21512;&#12387;&#12383;&#22580;&#21512;&#65292;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#20195;&#29702;&#12392;&#12375;&#12390;
&#30330;&#38899;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>map</b> <i>MapID1
from&minus;bank from&minus;prog to&minus;bank
to&minus;prog</i></p>

<p style="margin-left:22%;">GS/XG
&#21508;&#12510;&#12483;&#12503;&#12398;&#12488;&#12540;&#12531;&#38899;&#33394;&#12392;&#12375;&#12390;&#26082;&#23384;&#12398;&#12488;&#12540;&#12531;&#38899;&#33394;&#12434;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290;
<i>MapID1</i> &#12395;&#12399;&#65292;<b>gm2</b>,
<b>sc55</b>&#65292;<b>sc88</b>&#65292;<b>sc88pro</b>&#65292;
<b>sc8850</b>&#65292;<b>xg</b>&#65292;<b>xgsfx64</b>
&#12364;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>map</b> <i>MapID2
from&minus;drumset from&minus;keynote to&minus;drumset
to&minus;keynote</i></p>

<p style="margin-left:22%;">GS/XG
&#21508;&#12510;&#12483;&#12503;&#12398;&#12489;&#12521;&#12512;&#38899;&#33394;&#12392;&#12375;&#12390;&#26082;&#23384;&#12398;&#12489;&#12521;&#12512;&#38899;&#33394;&#12434;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290;
<i>MapID2</i> &#12395;&#12399;&#65292;<b>gm2drum</b>,
<b>sc55drum</b>&#65292;<b>sc88drum</b>&#65292;
<b>sc88prodrum</b>&#65292;<b>sc8850drum</b>&#65292;<b>xgdrum</b>&#65292;<b>xgsfx126</b>
&#12364;&#25351;
&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>soundfont</b> <i>file
[options]</i></p>

<p style="margin-left:22%;">SoundFont
&#12434;&#26368;&#21021;&#12363;&#12425;&#26368;&#24460;&#12414;&#12391;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;(&#37096;&#20998;&#30340;&#12395;&#35501;&#12415;&#36796;&#12416;&#12395;&#12399;&#65292;
<b>number %font</b>
&#12434;&#20351;&#12356;&#12414;&#12377;)&#12290;<i>options</i>
&#12399;&#65292;&#27425;&#12398;&#12418;&#12398;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;
&#12377;&#12290; <b><br>
order=</b><i>number</i></p>


<p style="margin-left:32%;">&#38899;&#33394;&#12487;&#12540;&#12479;&#12434;&#25506;&#12377;&#38918;&#30058;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;<b>order=0</b>
&#12398;&#12392;&#12365;&#12399;&#65292;&#12414;&#12378;
SoundFont
&#12434;&#35501;&#12415;&#36796;&#12435;&#12391;&#65292;&#12381;&#12398;&#24460;&#12395;&#36275;&#12426;&#12394;&#12356;&#12469;&#12531;&#12503;&#12523;&#12434;
GUS/patch &#12363;&#12425;&#25506;&#12375;&#12414;
&#12377;&#12290;<b>order=1</b>
&#12398;&#12392;&#12365;&#12399;&#65292;GUS/patch
&#12434;&#35501;&#12415;&#36796;&#12435;&#12384;&#24460;&#12395;
SoundFont &#12434;&#35501;&#12415;
&#36796;&#12415;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>amp=</b><i>amplification</i></p>

<p style="margin-left:32%;">SoundFont
&#20840;&#20307;&#12398;&#38899;&#37327;&#12434;
<i>amplification</i>%
&#12395;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;&#20516;&#12364;&#25351;&#23450;&#12373;&#12428;
&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#65292;<b>100</b>%
&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>


<p style="margin-left:22%;"><b>cutoff=</b><i>number</i></p>

<p style="margin-left:32%;">SoundFont
&#12395;&#35373;&#23450;&#12373;&#12428;&#12383; LPF
&#12398;&#26377;&#21177;(<b>1</b>)/&#28961;&#21177;(<b>0</b>)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
&#12418;&#12375;&#20516;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#65292;&#26377;&#21177;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%;"><b>reso=</b><i>number</i></p>

<p style="margin-left:32%;">SoundFont
&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12524;&#12478;&#12490;&#12531;&#12473;&#12398;&#26377;&#21177;(<b>1</b>)/&#28961;&#21177;(<b>0</b>)&#12434;&#25351;&#23450;&#12375;&#12414;
&#12377;&#12290;&#12418;&#12375;&#20516;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#65292;&#26377;&#21177;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;</p>

<table width="100%" border="0" rules="none" frame="void"
       cellspacing="0" cellpadding="0">
<tr valign="top" align="left">
<td width="22%"></td>
<td width="9%">


<p><b>remove</b></p></td>
<td width="1%"></td>
<td width="68%">


<p>&#23550;&#35937;&#12398; SoundFont
&#12434;&#36870;&#12395;&#12513;&#12514;&#12522;&#19978;&#12363;&#12425;&#24259;&#26820;&#12375;&#12414;&#12377;&#12290;</p> </td></tr>
</table>

<p style="margin-left:11%;"><b>font exclude</b> <i>bank
[prog [key]]</i></p>

<p style="margin-left:22%;">SoundFont
&#12398;&#26908;&#32034;&#12434;&#65292;<i>bank</i>
&#19978;&#12398; <i>prog</i>
&#12391;&#34892;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;
&#12377;&#12290;&#12489;&#12521;&#12512;&#12398;&#22580;&#21512;&#12399;&#12496;&#12531;&#12463;&#12364;
<b>128</b>
&#12391;&#12489;&#12521;&#12512;&#12475;&#12483;&#12488;&#12364;
<i>prog</i>&#65292;&#12461;&#12540; &#30058;&#21495;&#12364;
<i>key</i>
&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>font order</b> <i>number
bank [prog [key]]</i></p>

<p style="margin-left:22%;">SoundFont
&#12398;&#26908;&#32034;&#38918;&#24207;(&#19978;&#35352;&#21442;&#29031;)&#12434;&#65292;&#20491;&#21029;&#12395;&#25351;&#23450;&#12377;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;&#24341;&#25968;&#12398;
&#24847;&#21619;&#12399; <b>font exclude</b>
&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;</p>


<p style="margin-left:11%; margin-top: 1em"><b>TiMidity++</b>
&#12391;&#12399;&#65292;&#20197;&#19979;&#12398;&#25313;&#24373;&#21629;&#20196;&#12364;&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
<b><br>
#extension altassign</b> <i>program1 program2 ...</i></p>


<p style="margin-left:22%;">&#12489;&#12521;&#12512;&#12475;&#12483;&#12488;&#12395;&#12388;&#12356;&#12390;&#65292;&#12458;&#12523;&#12479;&#12493;&#12540;&#12488;&#12450;&#12469;&#12452;&#12531;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%; margin-top: 1em">drumset 0 <br>
altassign 42 44 46</p>


<p style="margin-left:22%; margin-top: 1em">&#12392;&#26360;&#12367;&#12392;&#65292;<b>drumset
0</b> &#12398; <b>42</b>&#65292;<b>44</b>&#65292;<b>46</b>
&#12364;&#25490;&#20182;&#30340;&#12395;&#40180;
&#12426;&#12414;&#12377;&#12290;<b>drumset 0</b>
&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#12458;&#12523;&#12479;&#12493;&#12540;&#12488;&#12450;&#12469;&#12452;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;
&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension comm</b>
<i>program comment</i></p>


<p style="margin-left:22%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#30058;&#21495;
<i>program</i> &#12395;&#12467;&#12513;&#12531;&#12488;
<i>comment</i> &#12434;&#25351;&#23450;&#12375;&#12414;
&#12377;&#12290;&#12371;&#12371;&#12391;&#35373;&#23450;&#12375;&#12383;
<i>comment</i> &#12399;&#65292;<b>&minus;int</b> &#12420;
<b>&minus;iTt</b> &#12458;&#12503;&#12471;
&#12519;&#12531;&#12391;&#36215;&#21205;&#12375;&#12383;&#26178;&#12395;&#65292;&#12452;&#12531;&#12472;&#12465;&#12540;&#12479;&#12521;&#12452;&#12531;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension timeout</b>
<i>program second</i></p>


<p style="margin-left:22%;">&#12452;&#12531;&#12473;&#12484;&#12523;&#12513;&#12531;&#12488;&#30058;&#21495;
<i>program</i> &#12391;&#65292;<i>second</i>
&#31186;&#20197;&#19978;&#12469;&#12473;&#12506;&#12531;&#12489;&#29366;
&#24907;&#12364;&#32154;&#12356;&#12383;&#22580;&#21512;&#65292;&#12381;&#12398;&#38899;&#12434;&#12458;&#12501;&#12395;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension copydrumset</b>
<i>drumset</i></p>

<p style="margin-left:22%;"><i>drumset</i>
&#30058;&#21495;&#12398;&#29366;&#24907;&#12377;&#12409;&#12390;&#12434;&#65292;&#29694;&#22312;&#12398;
<i>drumset</i>
&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension copybank</b>
<i>bank</i></p>

<p style="margin-left:22%;"><i>bank</i>
&#30058;&#21495;&#12398;&#29366;&#24907;&#12377;&#12409;&#12390;&#12434;&#65292;&#29694;&#22312;&#12398;
<i>bank</i>
&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension copymap</b>
<i>to&minus;MapID from&minus;MapID</i></p>

<p style="margin-left:22%;">&#12510;&#12483;&#12503;
<i>from&minus;MapID</i>
&#12395;&#23450;&#32681;&#12373;&#12428;&#12383;&#12496;&#12531;&#12463;&#12398;&#29366;&#24907;&#12377;&#12409;&#12390;&#12434;&#65292;&#12510;&#12483;&#12503;
<i>to&minus;MapID</i>
&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension HTTPproxy</b>
<i>hostname:port</i></p>

<p style="margin-left:22%;">HTTP
&#12398;&#12503;&#12525;&#12461;&#12471;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12503;&#12525;&#12461;&#12471;&#12398;&#12507;&#12473;&#12488;&#21517;&#12434;
<i>hostname</i> &#12395;&#65292;&#12509;
&#12540;&#12488;&#30058;&#21495;&#12434; <i>port</i>
&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension FTPproxy</b>
<i>hostname:port</i></p>

<p style="margin-left:22%;">FTP
&#12398;&#12503;&#12525;&#12461;&#12471;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12503;&#12525;&#12461;&#12471;&#12398;&#12507;&#12473;&#12488;&#21517;&#12434;
<i>hostname</i> &#12395;&#65292;&#12509;
&#12540;&#12488;&#30058;&#21495;&#12434; <i>port</i>
&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension mailaddr</b>
<i>your&minus;mail&minus;address</i></p>


<p style="margin-left:22%;">&#12518;&#12540;&#12470;&#12398;&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12434;&#65292;<i>your&minus;mail&minus;address</i>
&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;
&#12513;&#12540;&#12523;&#12450;&#12489;&#12524;&#12473;&#12399;&#65292;FTP
&#25509;&#32154;&#12434;&#12503;&#12525;&#12461;&#12471;&#12434;&#20171;&#12373;&#12378;&#12395;&#12480;&#12452;&#12524;&#12463;&#12488;&#12395;&#32331;&#12368;&#22580;&#21512;&#12395;&#29992;
&#12356;&#12425;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension opt</b>
<i>option</i></p>


<p style="margin-left:22%;">&#36215;&#21205;&#26178;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension undef</b>
<i>progno</i></p>


<p style="margin-left:22%;">&#29694;&#22312;&#12398;&#12496;&#12531;&#12463;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#30058;&#21495;
<i>progno</i>
&#12434;&#26410;&#23450;&#32681;&#12395;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension legato</b>
<i>progno</i> <b>{0|1}</b></p>

<p style="margin-left:22%;"><i>progno</i>
&#12391;&#12524;&#12460;&#12540;&#12488;&#12434;&#25499;&#12369;&#12427;(<b>1</b>)&#65292;&#25499;&#12369;&#12394;&#12356;(<b>0</b>)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension level</b>
<i>progno tva_level</i></p>

<p style="margin-left:22%;">NRPN &#12398; Drum Instrument
TVA Level
&#12434;&#20966;&#29702;&#12377;&#12427;&#38555;&#65292;&#38899;&#37327;&#12434;&#22793;&#21270;&#12373;&#12379;&#12427;&#22522;&#28310;&#12392;
&#12394;&#12427;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#26354;&#20013;&#12391;
Drum Instrument TVA Level
&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#38480;&#12426;&#65292;
&#38899;&#37327;&#12395;&#12399;&#19968;&#20999;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;&#12354;&#12367;&#12414;&#12391;&#22522;&#28310;&#20516;&#12391;&#12377;&#12290;<i>progno</i>
&#12399; &lsquo; ,&rsquo; &#12420; &lsquo; &lsquo;
[<i>start</i>]&minus;[<i>end</i>]&rsquo; &rsquo;
&#12391;&#19968;&#25324;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;<i>start</i>&#65292;
<i>end</i>
&#12399;&#30465;&#30053;&#12377;&#12427;&#12392;&#65292;&#12381;&#12428;&#12382;&#12428;
<b>0</b>&#65292;<b>127</b>
&#12392;&#35211;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension damper</b>
<i>progno</i> <b>{0|1}</b></p>

<p style="margin-left:22%;"><i>progno</i>
&#12391;&#12522;&#12480;&#12531;&#12497;&#12540;&#21177;&#26524;&#12362;&#12424;&#12403;&#12495;&#12540;&#12501;&#12480;&#12531;&#12497;&#12540;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;(<b>1</b>)&#65292;
&#28961;&#21177;&#12395;&#12377;&#12427;(<b>0</b>)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension playnote</b>
<i>progno note</i></p>


<p style="margin-left:22%;">&#12489;&#12521;&#12512;&#12475;&#12483;&#12488;&#38899;&#33394;&#12398;&#20986;&#38899;&#21608;&#27874;&#25968;&#12434;
<i>note</i> &#12392;&#12375;&#12414;&#12377;&#12290;GS SysEx
Play Note
&#12391;&#20986;&#38899;&#21608;&#27874;&#25968;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#65292;&#12371;&#12398;&#35373;&#23450;&#20516;&#12434;&#20803;&#12395;&#12500;&#12483;&#12481;&#12434;&#36969;&#20999;&#12395;&#22793;&#21270;&#12373;&#12379;
&#12414;&#12377;&#12290;<i>progno</i> &#12399; &lsquo;
,&rsquo; &#12420; &lsquo; &lsquo;
[<i>start</i>]&minus;[<i>end</i>]&rsquo; &rsquo;
&#12391;&#19968;&#25324;&#25351;&#23450;
&#12391;&#12365;&#12414;&#12377;&#12290;<i>start</i>&#65292;<i>end</i>
&#12399;&#30465;&#30053;&#12377;&#12427;&#12392;&#65292;&#12381;&#12428;&#12382;&#12428;
<b>0</b>&#65292; <b>127</b>
&#12392;&#35211;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%; margin-top: 1em">&#20363;: <br>
drumset 0 <br>
#extension playnote &minus;37,39,44&minus;46,55&minus;60</p>

<p style="margin-left:11%;"><b>#extension delaysend</b>
<i>progno level</i> <b><br>
#extension chorussend</b> <i>progno level</i> <b><br>
#extension reverbsend</b> <i>progno level</i></p>


<p style="margin-left:22%;">&#12489;&#12521;&#12512;&#12497;&#12540;&#12488;&#12539;&#12456;&#12501;&#12455;&#12463;&#12488;&#12364;&#12458;&#12531;&#12398;&#22580;&#21512;&#12398;&#12475;&#12531;&#12489;&#12524;&#12505;&#12523;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#21021;&#26399;&#20516;
&#12399;&#12377;&#12409;&#12390; <b>127</b>
&#12391;&#12377;&#12364;&#65292;delay&#65292;chorus&#65292;reverb
&#12398;&#12393;&#12428;&#12363;&#19968;&#12388;&#12391;&#12418;&#35373;&#23450;&#12373;
&#12428;&#12390;&#12356;&#12428;&#12400;&#65292;&#12381;&#12398;&#38899;&#33394;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12456;&#12501;&#12455;&#12463;&#12488;&#12399;&#21021;&#26399;&#20516;
<b>0</b> &#12395;&#12394;&#12426;
&#12414;&#12377;&#12290;<i>progno</i> &#12399; &lsquo;
,&rsquo; &#12420; &lsquo; &lsquo;
[<i>start</i>]&minus;[<i>end</i>]&rsquo; &rsquo;
&#12391;&#19968;&#25324;&#25351;&#23450;
&#12391;&#12365;&#12414;&#12377;&#12290;<i>start</i>&#65292;<i>end</i>
&#12399;&#30465;&#30053;&#12377;&#12427;&#12392;&#65292;&#12381;&#12428;&#12382;&#12428;
<b>0</b>&#65292; <b>127</b>
&#12392;&#35211;&#12394;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<p style="margin-left:11%;"><b>#extension rnddelay</b>
<i>progno msec</i></p>

<p style="margin-left:22%;">&#26368;&#22823; <i>msec</i>
&#20197;&#20869;&#12398;&#12487;&#12451;&#12524;&#12452;&#12434;&#65292;&#30330;&#38899;&#27598;&#12395;&#12521;&#12531;&#12480;&#12512;&#12391;&#20184;&#21152;&#12375;&#12414;&#12377;&#12290;&#12521;&#12531;&#12480;
&#12512;&#20516;&#12398;&#20998;&#24067;&#12399;&#12507;&#12527;&#12452;&#12488;&#12494;&#12452;&#12474;&#12392;&#12356;&#12358;&#12424;&#12426;&#65292;&#12416;&#12375;&#12429;&#12500;&#12531;&#12463;&#12494;&#12452;&#12474;(1/f
&#12422;&#12425;&#12366;)&#12391; &#12377;&#12290;</p>


<p style="margin-left:11%; margin-top: 1em">&#12371;&#12428;&#12425;&#12398;&#25313;&#24373;&#21629;&#20196;&#12399;
&lsquo; #&rsquo;
&#12363;&#12425;&#22987;&#12414;&#12387;&#12390;&#12362;&#12426;&#65292;&#21476;&#12356;
TiMidity
&#12391;&#12399;&#21336;&#12394;&#12427;&#12467;&#12513;&#12531;
&#12488;&#12392;&#25201;&#12431;&#12428;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#12424;&#12387;&#12390;&#65292;&#21476;&#12356;
TiMidity
&#12392;&#12398;&#20114;&#25563;&#24615;&#12434;&#20445;&#12388;&#12371;&#12392;&#12364;&#12391;
&#12365;&#12414;&#12377;&#12290; <br>
&#12394;&#12362;&#65292;<b>TiMidity++</b> &#12391;&#12399;
<b>#extension</b>
&#12399;&#31354;&#30333;&#12392;&#12375;&#12390;&#25201;&#12431;&#12428;&#12427;&#12424;&#12358;&#12395;
&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>


<p style="margin-left:11%; margin-top: 1em"><b>TiMidity++</b>
&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;(*.cfg)&#20013;&#12398;
<b>source</b> &#12398;&#24341;&#25968;&#12395; UNIX
&#12398;&#12467;&#12510;&#12531;&#12489;&#12363;&#12425;&#12398;&#20986;&#21147;&#12434;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;(UNIX
&#12398;&#12415;)&#12290;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#26368;&#24460;&#12395;
&lsquo; |&rsquo; (ASCII
0x7c)&#12434;&#35352;&#36848;&#12377;&#12427;&#12392; UNIX
&#12467;&#12510;&#12531;&#12489;&#12392;&#12415;&#12394;&#12373;&#12428;&#65292;&#12381;&#12398;&#12467;&#12510;&#12531;&#12489;&#12398;&#20986;&#21147;&#12364;
<b>source</b>
&#12398;&#24341;&#25968;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
<b><br>
source</b> <i>command</i>|
&#12398;&#12424;&#12358;&#12395;&#12377;&#12427;&#12392;&#65292;<i>command</i>
&#12398;&#20986;&#21147;&#12364; <b>source</b>
&#12398;&#24341;&#25968;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#29872;&#22659;&#12395;&#12424;&#12387;&#12390;
<b>TiMidity++</b> &#12398;&#35373;&#23450;&#12434;&#36984;
&#25246;&#12375;&#12383;&#12356;&#22580;&#21512;&#12394;&#12393;&#12395;&#20415;&#21033;&#12391;&#12377;&#12290;&#12394;&#12362;&#65292;<i>command</i>
|
&#12398;&#12424;&#12358;&#12395;&#65292;&#36884;&#20013;&#12395;&#12473;&#12506;
&#12540;&#12473;&#12364;&#20837;&#12427;&#12392;&#65292;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#35501;&#12415;&#36796;&#12415;&#26178;&#12395;&#21306;&#20999;&#12425;&#12428;&#12390;&#12375;&#12414;&#12356;&#65292;&#12467;&#12510;&#12531;&#12489;&#12392;&#35211;&#12394;
&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#27231;&#33021;&#12399;&#12501;&#12449;&#12452;&#12523;&#21517;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12377;&#12409;&#12390;&#12398;&#22580;&#25152;
&#12395;&#36969;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<p style="margin-left:22%; margin-top: 1em">timidity
&rsquo; cat fild.mid|&rsquo;</p>


<p style="margin-left:11%; margin-top: 1em">&#12399;&#65292;cat
fild.mid
&#12398;&#20986;&#21147;&#32080;&#26524;&#12363;&#12425;&#35501;&#12415;&#21462;&#12426;&#12414;&#12377;&#12290;</p>

<h2>&#12501;&#12449;&#12452;&#12523;
<a name="&#12501;&#12449;&#12452;&#12523;"></a>
</h2>



<p style="margin-left:11%; margin-top: 1em"><b>/etc/timidity.cfg
<br>
/usr/local/share/timidity/timidity.cfg</b></p>

<h2>&#38306;&#36899;&#38917;&#30446;
<a name="&#38306;&#36899;&#38917;&#30446;"></a>
</h2>


<p style="margin-left:11%; margin-top: 1em">timidity(1),
lsmidiprog(1), mididump(1), patinfo(1), sf2text(1),
wav2pat(1)</p>

<h2>&#33879;&#20316;&#27177;
<a name="&#33879;&#20316;&#27177;"></a>
</h2>


<p style="margin-left:11%; margin-top: 1em">Copyright (C)
1999&minus;2004 Masanao Izumo &lt;iz@onicos.co.jp&gt; <br>
Copyright (C) 1995 Tuukka Toivonen &lt;tt@cgs.fi&gt;</p>

<p style="margin-left:11%; margin-top: 1em">The original
version was developed by Tuukka Toivonen &lt;tt@cgs.fi&gt;
until the release of TiMidity&minus;0.2i. His development
was discontinued because of his being busy with work.</p>

<p style="margin-left:11%; margin-top: 1em">This program is
free software; you can redistribute it and/or modify it
under the terms of the <i>GNU General Public License</i> as
published by the Free Software Foundation; either version 2
of the License, or (at your option) any later version.</p>

<p style="margin-left:11%; margin-top: 1em">This program is
distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
<i>GNU General Public License</i> for more details.</p>

<p style="margin-left:11%; margin-top: 1em">You should have
received a copy of the GNU General Public License along with
this program; if not, write to the Free Software Foundation,
Inc., 59 Temple Place, Suite 330, Boston, MA
02111&minus;1307 USA</p>

<h2>&#20837;&#25163;&#20803;
<a name="&#20837;&#25163;&#20803;"></a>
</h2>



<p style="margin-left:11%; margin-top: 1em"><b>TiMidity++</b>
&#12399; &#25913;&#33391;&#29256; TiMidity
&#12398;&#12506;&#12540;&#12472;</p>

<p style="margin-left:11%; margin-top: 1em">URL
https://sourceforge.net/projects/timidity/</p>


<p style="margin-left:11%; margin-top: 1em">&#12391;&#25163;&#12395;&#20837;&#12426;&#12414;&#12377;&#12290;</p>
<hr>
</body>
</html>
